tap 'arbourd/tap'
tap 'github/gh'
tap 'homebrew/cask'
tap 'homebrew/cask-drivers'
tap 'homebrew/cask-fonts'
tap 'homebrew/services'
tap 'instrumenta/instrumenta'
tap 'wagoodman/dive'

brew 'awscli'
brew 'azure-cli'
brew 'bash'
brew 'dep'
brew 'dive'
brew 'fish'
brew 'gh'
brew 'git'
brew 'git-get'
brew 'git-lfs'
brew 'gnupg'
brew 'go'
brew 'goreleaser'
brew 'graphviz'
brew 'hostess'
brew 'htop-osx'
brew 'hub'
brew 'iperf3'
brew 'jq'
brew 'krew'
brew 'kubectx'
brew 'kubernetes-cli'
brew 'kubernetes-helm'
brew 'kubeval'
brew 'linkerd'
brew 'make'
brew 'mkcert'
brew 'openssl'
brew 'pinentry-mac'
brew 'python3'
brew 'ripgrep'
brew 'ruby'
brew 'rust'
brew 'shellcheck'
brew 'ssh-copy-id'
brew 'stern'
brew 'terraform'
brew 'tflint'
brew 'tmux'
brew 'trashOS'
brew 'vault'
brew 'vim'
brew 'watch'
brew 'webtorrent-cli'
brew 'wget'
brew 'yaegi'
brew 'yamllint'
brew 'yarn'
brew 'yq'
brew 'zsh'

cask '1password'
cask '1password-cli'
cask 'appcleaner'
cask 'bettertouchtool'
cask 'brave-browser'
cask 'caret'
cask 'discord'
cask 'docker'
cask 'firefox'
cask 'flux'
cask 'google-chrome'
cask 'google-cloud-sdk'
cask 'insomnia'
cask 'iterm2'
cask 'kap'
cask 'logitech-options'
cask 'monodraw'
cask 'ngrok'
cask 'nordvpn'
cask 'notion'
cask 'plex'
cask 'slack'
cask 'telegram'
cask 'viscosity'
cask 'visual-studio-code'
cask 'whatsapp'
cask 'zoomus'

cask 'font-source-code-pro-for-powerline'

unless ENV.has_key?('CI') then
    brew 'mas'
    mas 'Jira', id: 1475897096
    mas 'Todoist', id: 585829637
    mas 'Xcode', id: 497799835
end

