tap 'arbourd/tap'
tap 'fluxcd/tap'
tap 'hashicorp/tap'
tap 'just-an-oldsalt/proto-mcp'
tap 'neurosnap/tap'
tap 'stefanprodan/tap'
tap 'terraform-linters/tap'

brew 'age'
brew 'ansifilter'
brew 'bash'
brew 'bats-core'
brew 'bash-completion@2'
brew 'stefanprodan/tap/cctop'
brew 'container'
brew 'coreutils'
brew 'curlie'
brew 'fish'
brew 'fluxcd/tap/flux'
brew 'gawk'
brew 'gh'
brew 'git'
brew 'arbourd/tap/git-get'
brew 'arbourd/tap/git-open'
brew 'arbourd/tap/git-sync'
brew 'gnupg'
brew 'gnu-sed'
brew 'arbourd/tap/go'
brew 'grep'
brew 'helm'
brew 'hostess'
brew 'htop'
brew 'httpie'
brew 'icloudpd'
brew 'iperf3'
brew 'kubeconform'
brew 'kubectl'
brew 'kubectx'
brew 'kustomize'
brew 'make'
brew 'mas'
brew 'mkcert'
brew 'nushell'
brew 'opencode'
brew 'openssl'
brew 'opentofu'
brew 'parallel'
brew 'pi-coding-agent'
brew 'pinentry-mac'
brew 'procs'
brew 'ripgrep'
brew 'rtk'
brew 'rustup'
brew 'shellcheck'
brew 'sccache'
brew 'sops'
brew 'swiftlint'
brew 'talhelper'
brew 'talosctl'
brew 'hashicorp/tap/terraform'
brew 'tfsec'
brew 'tmux'
brew 'arbourd/tap/trash'
brew 'vim'
brew 'watch'
brew 'wget'
brew 'yq'
brew 'zig'
brew 'neurosnap/tap/zmx'
brew 'zoxide'
brew 'zstd'

cask '1password'
cask 'antigravity-cli'
cask 'appcleaner'
cask 'balenaetcher'
cask 'claude'
cask 'claude-code'
cask 'firefox'
cask 'ghostty'
cask 'google-chrome'
cask 'google-gemini'
cask 'goreleaser/tap/goreleaser'
cask 'httpie-desktop'
cask 'iterm2'
cask 'kap'
cask 'logi-options+'
cask 'middleclick'
cask 'monitorcontrol'
cask 'monodraw'
cask 'notion'
cask 'notunes'
cask 'just-an-oldsalt/proto-mcp/proto-mcp'
cask 'proton-mail'
cask 'protonvpn'
cask 'rwts-pdfwriter'
cask 'sabnzbd'
cask 'signal'
cask 'supacode'
cask 'tailscale-app'
cask 'terraform-linters/tap/tflint'
cask 'utm'
cask 'visual-studio-code'
cask 'zed'

cask 'font-source-code-pro'
cask 'font-source-code-pro-for-powerline'

mas '1Password for Safari', id: 1569813296
mas 'AdGuard for Safari', id: 1440147259
mas 'The Camelizer', id: 1532579087
mas 'Consent-O-Matic', id: 1606897889
mas 'Hush Nag Blocker', id: 1544743900
mas 'JSON Peep for Safari', id: 1458969831
mas 'Kagi for Safari', id: 1622835804
mas 'Noir', id: 1592917505
# iOS-only apps; mas cannot install them - install manually from the App Store
# https://github.com/mas-cli/mas/issues/321
# mas 'Ubiquiti WiFiman', id: 1385561119
# mas 'UniFi', id: 1057750338
# mas 'UniFi Protect', id: 1392492235
mas 'Xcode', id: 497799835
