fisherman/await
oh-my-fish/theme-cmorrell.com
fisherman/fnm
fisherman/get_file_age
fisherman/getopts
fisherman/gitignore
fisherman/last_job_id
fisherman/menu
fisherman/pyenv
fisherman/rbenv
fisherman/spin
