fisherman/await
fisherman/docker-completion
arbourd/fishtape
fisherman/fnm
fisherman/get_file_age
fisherman/getopts
fisherman/git_util
fisherman/gitignore
fisherman/last_job_id
fisherman/menu
arbourd/prompt
fisherman/pyenv
fisherman/rbenv
fisherman/spin
arbourd/trash
