fisherman/await
fisherman/docker-completion
fisherman/fishtape
fisherman/fnm
fisherman/free
fisherman/get_file_age
fisherman/getopts
fisherman/git_util
fisherman/gitignore
evanlucas/fish-kubectl-completions
fisherman/last_job_id
fisherman/menu
arbourd/prompt
fisherman/rbenv
fisherman/spin
